new_2022.12.15/MTO_ThermalFluidStructural/app/constant/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
rho                 1;
rhoE                7e10;//杨氏模量
Po                  0.33;//泊松比
planeStress         no;//是否是平面应力问题
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
